[
  {
    "moon_sign": "aries",
    "description": "The first sign of the zodiac, Aries is known for an impulsive and fiery disposition. Likewise, those born with an Aries moon are often identified by their signature hot-headedness. Aries moons know what they want (or, at the very least, their desires can feel like needs). They're emotionally satisfied by excitement, spontaneity, and victory, whatever that means to them. Having an Aries moon may feel like having a beautiful yet temperamental child living inside of you who always has to go first and get what they want. Their challenge is to merge this strength with the maturity of their other, often Earth sign placements. "
  },
  
  {
    "moon_sign": "taurus",
    "description": "Taurus is one of the most sensual signs of the zodiac. Those born with a Taurus moon are satiated by cozy environments, delicious meals, and expressions of luxury. The Taurus moon is a creature of habit and will always prefer stability over change. A Taurus moon can provide grounding, especially in contrast to an emotional water sign sun. "
  },

  {
    "moon_sign": "gemini",
    "description": "Gemini is known for mercuriality (after all, this air sign is governed by Mercury). A Gemini grounds themselves with facts and information, so communication is paramount for those born under a Gemini moon. It is critical that Gemini moons have outlets for expression: They should celebrate their loquaciousness and socialize in a variety of communities. Gemini energy requires a lot of attention and upkeep, so those with Gemini moons must ensure someone is always fawning over them."
  },

  {
    "moon_sign": "cancer",
    "description": "The moon governs Cancer, so as a moon sign, Cancer is in its planetary domicile. Those born under this lunation are extremely impacted by their surroundings and can instantly read the energy of a room. As the moon is constantly changing, their emotions are always in flux. It's important for the Cancer moon to always feel safe and supported, so those with Cancer moons would be wise to keep a trusted inner circle of family and friends."
  },

  {
    "moon_sign": "leo",
    "description": "Leo is ruled by the sun, but in a moon placement, this fire sign needs to work twice as hard to make sure it's visible. The Leo moon is a creative spirit, fueled by warmth, generosity, and (naturally) an audience. The Leo moon hates to feel eclipsed, so those born under this lunation should find stages on which they can share their innate gifts. If a Leo moon is neglected, those may act out like brats until they receive the attention that they crave. Those with Leo moons tend to end up famous for something or other. "
  },

  {
    "moon_sign": "virgo",
    "description": "Virgo is the most analytical sign of the zodiac. Accordingly, those with a Virgo moon placement are satisfied by logic, organization, and structure. Virgo moons excel at creating comprehensive, dynamic systems for themselves and, perhaps even more importantly, for others. They love to be helpful and are always fulfilled when contributing in practical ways. Virgo moons require a lot of soothing, as their mind never stops worrying. Those with Virgo moons should implement a mindfulness practice, try meditating, and work with a therapist to keep anxious thoughts at bay. "
  },

  {
    "moon_sign": "libra",
    "description": "Libra is symbolized by the scales, a visual representation of balance, harmony, and union. Those born under this lunation are natural mediators, and Libra moons are happiest when keeping the peace. They also thrive in partnership, so it's common to find Libra moons moving seamlessly between relationships. In fact, sometimes Libra moons may start a new romance while in the middle of another one! Libra moons will benefit from finding validation through themselves rather than others. "
  },

  {
    "moon_sign": "scorpio",
    "description": "Scorpio is a water sign, known for its high-octane emotional intensity. Scorpio moons crave deep connections and transformative experiences, and they also take privacy seriously. Those with this placement should honor it by creating (and maintaining) boundaries. Because they are prone to volatile emotions, it's important for Scorpio moons to prioritize mental health. Oh yes, they are also quite horny and can be duplicitous at times, but once they choose someone, they're loyal for life."
  },

  {
    "moon_sign": "sagittarius",
    "description": "Sagittarius is the last fire sign, represented by the archer. Sagittarius is known for brazen curiosity, and Sagittarius moons are fulfilled by philosophy, travel, and intellectual expansion. Those born under this placement are always on a quest, and it's important for them to have the freedom to explore and embrace the unknown. Those with Sagittarius moons must be careful of talking over people, dominating conversations, and acting smarter than everyone else around them. But, they are so much fun to be around, they can get away just about anything."
  },

  {
    "moon_sign": "capricorn",
    "description": "Hardworking and industrious, Capricorn is renowned for steadfast dedication. Within a moon placement, Capricorn is fulfilled through successes and achievements. Those born under this lunation take their responsibilities seriously, connecting their emotions to their accomplishments. The Capricorn moon should always be working toward a goal. But Capricorn moons aren't all work and no play. They have quite the naughty side and impress everyone by partying all night after working all day and someone being amazing at all of it. Capricorn moons will benefit from opening up and sharing their emotions, as they tend to put up brick walls."
  },

  {
    "moon_sign": "aquarius",
    "description": "Aquarius is the most humanitarian sign of the zodiac, so those born under this moon experience their emotions as part of the collective experience. The Aquarius moon is fueled by egalitarianism, so these individuals often emote based on their values rather than their sensitivities. The Aquarian moon wants to do the right thing — even if that means putting the greater good above their own needs. Despite their potential humanitarian interests, Aquarius moons can also be distant, unreliable, and a bit holier than thou. They must make sure to actually value others as much as they value themselves."
  },

  {
    "moon_sign": "pisces",
    "description": "The final sign of the zodiac is associated with great empathy and innate psychic powers. Accordingly, sensitive Pisces moons are constantly absorbing energy. They feel deeply, and without an anchor, they can easily be engulfed in a sea of emotions. Those with this placement should honor their moon sign by celebrating their otherworldly creativity and benevolent generosity. Those with Pisces moons are also deeply spiritual and philosophical and love sharing their knowledge with others. Pisces moons tend to be described as old souls."
  }
]