[
  {
    "rising_sign": "aries",
    "description": "If you're an Aries rising, chances are you come off as brave, opinionated, and independent. You have a powerful and commanding presence and may even be seen as intimidating. You are the fierce warrior of the zodiac. Aries' ruling planet is Mars, the god of war. Being the first sign, you lead the cavalry. As the first fire sign of the zodiac, you are intensely competitive and view the world as a series of competitions. Aries rising, you are a trailblazer who leaps before you look and asks for forgiveness, not permission. You also act on your instincts, which are usually spot-on."
  },

  {
    "rising_sign": "taurus",
    "description": "If you're a Taurus rising, you likely give off fierce, dependable, and strong-willed vibes. But you also have a softer side. You enjoy the good things in life, including beautiful clothes, fine food, and massages. Taurus sometimes gets pigeonholed as materialistic, and while you do like to surround yourself with gorgeous finery, you're also hard-working enough that you've earned a bit of luxury. Your ruling planet is sensual Venus, the goddess of beauty, love, and abundance, so you can't help that you have refined taste. You're the first earth sign, and you represent earthiness in its purest form. This means you like being active and creative with your hands — for you, this could mean gardening, cooking, knitting, or even the challenge of finding an innovative new makeup look."
  },
  
  {
    "rising_sign": "gemini",
    "description": "If you're a Gemini rising, people likely perceive you as talkative, bright, and curious. Your highly creative mind can spit out ideas a mile a minute. However, you might get overwhelmed sometimes by the desire to do everything at once. This same principle can be applied to your love life. Geminis are infamous heartbreakers and can be very picky when settling down with someone. It's not because you're insensitive; it's because you're waiting for your perfect match (this sign is represented by the twins). Gemini's ruling planet is Mercury, the messenger of the gods. As a result, you come off as charming, well-spoken, and are likely an excellent public speaker."
  },

  {
    "rising_sign": "cancer",
    "description": "If you're a Cancer rising, then 'traditional' and 'nurturing' are words often used to describe you. You like your routine — after all, you've taken time and care to establish yourself and make things exactly the way you want them to be. Your home life is very important to you, so you tend to care deeply about your personal space and the people allowed inside. You might also be the person people come to with problems because you know how to hold space for people. But don't get it twisted, Cancers are more than the sensitive beings people often make them out to be. They come with pinchers and a hard exterior, after all. But because the intuitive moon rules the sign, you present yourself as kind and poetic as long as your claws aren't out."
  },

  {
    "rising_sign": "leo",
    "description": "If you're a Leo rising, people probably think of you as confident, vibrant, and fun. You have a flair for the dramatic, and people immediately notice when you walk into the room. Whether you work in the arts or just have an epic Instagram feed, you are also highly creative. Seeing you live your best life inspires others to do the same. Leo season is the summer, and you carry that carefree, sunny spirit with you. This sign is also known as the child of the zodiac. Like children, you live in the moment but can also be a little demanding. Not everyone can keep up with your fiery energy, but don't let the haters get you down. Leo's ruling planet is the powerful sun, so you were made for the spotlight (and likely have great hair and a fantastic sense of style)."
  },

  {
    "rising_sign": "virgo",
    "description": "If you're a Virgo rising, people who meet you may describe you as organized, put together, and reliable. You may give the air of a perfectionist, which can be a bit intimidating at times. This sign's ruling planet is messenger Mercury, and as a result, Virgo risings are communicative and curious. Friends and lovers likely come to you for advice. Virgo is the healer of the zodiac and cares deeply about those around them. If you're a Virgo rising, make sure to carve out time to care for yourself as well as others."
  },

  {
    "rising_sign": "libra",
    "description": "If you're a Libra rising, those who come into contact with you likely think of you as attractive, romantic, and sweet (although you may have a sharp tongue at times, even if that just means you're witty). You may have heard that Libras are indecisive, and while this may be true, it comes with good intentions because you generally want everyone to be happy. The scales represent this air sign, and as a result, you may always try to keep the peace and ensure justice is served. It's also the sign of partnerships, and with lover Venus as your ruling planet, Libra risings tend to be flirty and ethereal. "
  },

  {
    "rising_sign": "scorpio",
    "description": "If you're a Scorpio rising, you may come off as mysterious, quiet, and alluring. It's not always a sexually charged charm, although it can be. Scorpios have a reputation for being the most sexual sign of the zodiac, so your inherent sensuality may intimidate others when they first meet you. Most of the time, there's so much going on behind that cool, pristine face that people want to know more and can't stay away. Rising Scorpios are intense, and you have your reasons. You've likely had some experiences that have caused you to put up your guard, especially if you have other Scorpio influences in your chart. This sign is ruled by both the warrior Mars, and Pluto, the lord of the underworld, which explains some of the intensity. "
  },


  {
    "rising_sign": "sagittarius",
    "description": "If you're a Sagittarius rising, people may describe you as intelligent and a fabulous storyteller who is always the life of the party. You have a zest for life that's contagious and are known as the optimist of the zodiac. The glass is always half full for you. You are outspoken, opinionated, and say what others aren’t saying. You can often be quite blunt, and sometimes it backfires. But, because the lucky planet Jupiter rules Sagittarius, you always come out on top. "
  },

  {
    "rising_sign": "capricorn",
    "description": "If you're a Capricorn rising, you likely come off as mature, organized, and driven. You are always put together and prepared. People may think of you as a skilled businessperson with little interest in games, both in your professional and personal life. You strive for greatness, and you expect much of yourself and others. Much of this is because strict Saturn rules Capricorn, giving you major disciplinarian vibes. And yes, rising Cap, this can be as kinky as it sounds. While people tend to focus on your ambition, you also have a wild devilish side, which can be addictive to lovers."
  },

  {
    "rising_sign": "aquarius",
    "description": "If you're an Aquarius rising, you may be perceived as intellectual, innovative, and a humanitarian. Some think the 'aqua' in Aquarius means you're a water sign, but Aquarius is actually the third air sign (along with Gemini and Libra) and a symbol of the water bearer. This sign has much more to do with community and being part of the collective; it's about sharing the water, not being the water. You're also known for being very individualistic and unafraid to let your freak flag fly. Your ruling planet is Uranus, which is as eccentric as you are."
  },

  {
    "rising_sign": "pisces",
    "description": "If you’re a Pisces rising, people likely describe you as dreamy and empathetic, and you may sometimes have your head a bit in the clouds. This sign is known as the psychic of the zodiac and since it’s the last sign, it carries all the other signs in it. Therefore, you are intrinsically linked to all of humanity. When someone meets you for the first time, you may seem like you’re not paying attention and your mind is elsewhere. That may be partially true, but you are also taking in everything, including the person's words, body language, and underlying emotions. Pisces' ruling planet is the magical Neptune, which makes you mysterious and alluring."
  }
]